# make sure brew is up to date
#brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'homebrew/php'
tap "mongodb/brew"

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install Binaries
brew 'git'
brew 'grep'
brew 'fzf'
brew 'ripgrep'
brew 'neofetch'
brew 'tree'
brew 'rename'
brew 'node'
brew 'trash'
brew 'cmake'
brew 'ssh-copy-id'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'mas'

# Development
brew 'python'
brew 'nvm'

# databases
brew 'mysql'
brew 'sqlite'
brew 'postgresql'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'alacritty'
cask 'visual-studio-code'
cask 'slack'
# cask 'Caskroom/cask/karabiner-elements'
cask 'karabiner-elements'
cask 'caffeine'
cask 'rectangle'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'postman'
cask 'vlc'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-mononoki-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
